app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `updated_at`, `created_at`) VALUES('tom', '2011-01-14 00:05:11', '2011-01-14 00:05:11')
SELECT * FROM `users` WHERE (`users`.`name` IS NULL) LIMIT 1
SELECT * FROM `playlists` WHERE (`playlists`.`lastfm_id` = '8142029') AND (`playlists`.user_id = 1) LIMIT 1
SELECT * FROM `users`
INSERT INTO `playlists` (`name`, `updated_at`, `playlist_url`, `lastfm_id`, `user_id`, `created_at`) VALUES('Jazz', '2011-01-17 17:11:55', NULL, 8188917, 4, '2011-01-17 17:11:55')
INSERT INTO `tracks` (`playlist_id`, `updated_at`, `track_name`, `artist_name`, `ut_url`, `yt_url`, `lastfm_id`, `created_at`) VALUES(19, '2011-01-16 20:34:21', 'New Flowers', 'Tanlines New Flowers', NULL, 'http://www.youtube.com/v/uFmqaq4aAro&feature=youtube_gdata_player', NULL, '2011-01-16 20:34:21')
SELECT * FROM `tracks` WHERE (`tracks`.`track_name` = 'Say It (Over And Over Again)' AND `tracks`.`artist_name` = 'John Coltrane Quartet') AND (`tracks`.playlist_id = 15) LIMIT 1
---
  def create
    require 'open-uri'
  	LastFM.api_key = "c44173b28da0543a105aece7c1ad4e17"
    LastFM.client_name = "gigkong"
    ytclient = YouTubeIt::Client.new(:dev_key => "AI39si59NcA_DXFPnwRu1g9siXAze22t2YeICB8bt5s6TG7OG9uBvE83qKv2p_GXTKGaIQkd4x3U2aghthm495-g6EhbISvuNg")

    #check if user exists and get playlists
    @playlists = LastFM::User.get_playlists(:user => params[:user][:name])
    if @playlists["error"] == 6
      redirect_to("http://192.168.27.65:3000", :notice => 'We couldnt find that Username. Try again!')
    else
      @u = User.find_or_create_by_name(params[:user][:name])

      if @playlists["playlists"]["playlist"].respond_to?("first")
        @playlists["playlists"]["playlist"].each do |p|
          url = "lastfm://playlist/" << p["id"]
          @newp = @u.playlists.find_or_create_by_lastfm_id(:lastfm_id => p["id"], :name => p["title"], :playlist_url => url)
          @tracklist = LastFM::Playlist.fetch(:playlistURL => url)["playlist"]["trackList"]["track"]
          @tracklist.each do |t|
            track_search_name = t["creator"] + " " + t["title"]
            ytreply = ytclient.videos_by(:query => track_search_name, :max_results => 1, :format => 5, :category => 'music')
            if ytreply.videos != []
              @newp.tracks.find_or_create_by_track_name_and_artist_name(:track_name => t["title"], :artist_name => t["creator"], :yt_url => ytreply.videos.first.player_url)

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2011-01-13 23:55:27', `name` = 'joe' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
DELETE FROM `users` WHERE `id` = 3
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy